spiricom/Electrobass_embedded/PSOC5_electrobass_stringsensors/CE210514_PSOC3_5_Thermistor.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "MISO_1_aliases.h"
#include "MISO_1.h"
#include "MOSI_1_aliases.h"
#include "MOSI_1.h"
#include "AMux_1.h"
#include "IDAC8_1.h"
#include "SCLK_1_aliases.h"
#include "SCLK_1.h"
#include "ADC_1.h"
#include "ExtMUXS0_aliases.h"
#include "ExtMUXS0.h"
#include "V_T_1_1_aliases.h"
#include "V_T_1_1.h"
#include "knob_1_01_aliases.h"
#include "knob_1_01.h"
#include "joy_y_23_aliases.h"
#include "joy_y_23.h"
#include "CapSense.h"
#include "CapSense_CSHL.h"
#include "CapSense_Pins.h"
#include "CapSense_TunerHelper.h"
#include "joy_x_25_aliases.h"
#include "joy_x_25.h"
#include "down_aliases.h"
#include "down.h"
#include "IDAC_OUT_aliases.h"
#include "IDAC_OUT.h"
#include "SPIM_1.h"
#include "SPIM_1_PVT.h"
#include "USB.h"
#include "USB_audio.h"
#include "USB_cdc.h"
#include "USB_hid.h"
#include "USB_midi.h"
#include "USB_pvt.h"
#include "USB_cydmac.h"
#include "USB_msc.h"
#include "ADC_SAR_Seq_1.h"
#include "SS_1_aliases.h"
#include "SS_1.h"
#include "blue_LED_aliases.h"
#include "blue_LED.h"
#include "knob_2_36_aliases.h"
#include "knob_2_36.h"
#include "ExtMUX_EN_aliases.h"
#include "ExtMUX_EN.h"
#include "ExtMUXS1_aliases.h"
#include "ExtMUXS1.h"
#include "SPI_ready_aliases.h"
#include "SPI_ready.h"
#include "enter_aliases.h"
#include "enter.h"
#include "DMA_1_RX_dma.h"
#include "DMA_1_TX_dma.h"
#include "I2C_1.h"
#include "I2C_1_PVT.h"
#include "CV_pedal_sense_aliases.h"
#include "CV_pedal_sense.h"
#include "SDA_1_aliases.h"
#include "SDA_1.h"
#include "V_T_1_2_aliases.h"
#include "V_T_1_2.h"
#include "SCL_1_aliases.h"
#include "SCL_1.h"
#include "V_H_aliases.h"
#include "V_H.h"
#include "up_aliases.h"
#include "up.h"
#include "fretted_mom_aliases.h"
#include "fretted_mom.h"
#include "fretted_latching_aliases.h"
#include "fretted_latching.h"
#include "DMA_2_RX_dma.h"
#include "MISO_2_aliases.h"
#include "MISO_2.h"
#include "MOSI_2_aliases.h"
#include "MOSI_2.h"
#include "SCLK_2_aliases.h"
#include "SCLK_2.h"
#include "SPIM_2.h"
#include "SPIM_2_PVT.h"
#include "SS_2_aliases.h"
#include "SS_2.h"
#include "cv_pedal_aliases.h"
#include "cv_pedal.h"
#include "DMA_2_TX_dma.h"
#include "Em_EEPROM.h"
#include "vBusPin_aliases.h"
#include "vBusPin.h"
#include "my_Vbus_ISR.h"
#include "EEPROM.h"
#include "LED_1_aliases.h"
#include "LED_1.h"
#include "ADC_1_Ext_CP_Clk.h"
#include "ADC_1_Bypass_P03_aliases.h"
#include "ADC_1_Bypass_P03.h"
#include "ADC_1_IRQ.h"
#include "ADC_1_theACLK.h"
#include "CapSense_CompCH0.h"
#include "CapSense_IdacCH0.h"
#include "CapSense_AMuxCH0.h"
#include "CapSense_CompCH1.h"
#include "CapSense_IdacCH1.h"
#include "CapSense_AMuxCH1.h"
#include "CapSense_IntClock.h"
#include "SPIM_1_IntClock.h"
#include "USB_Vbus_ps.h"
#include "USB_EP17_DMA_Done_SR.h"
#include "USB_ep2_dma.h"
#include "USB_ep1_dma.h"
#include "USB_Dm_aliases.h"
#include "USB_Dm.h"
#include "USB_Dp_aliases.h"
#include "USB_Dp.h"
#include "USB_EP_DMA_Done_isr.h"
#include "USB_EP8_DMA_Done_SR.h"
#include "ADC_SAR_Seq_1_SAR.h"
#include "ADC_SAR_Seq_1_IntClock.h"
#include "ADC_SAR_Seq_1_TempBuf_dma.h"
#include "ADC_SAR_Seq_1_FinalBuf_dma.h"
#include "ADC_SAR_Seq_1_IRQ.h"
#include "SPIM_2_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

